Revit 2024 API
gbXMLBuildingHVACSystem Enumeration
 Enumerations for gbXML (Green Building XML) format, used for energy analysis, schema version 0.34.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum gbXMLBuildingHVACSystem
Visual Basic
Public Enumeration gbXMLBuildingHVACSystem
Visual C++
public enum class gbXMLBuildingHVACSystem
Members
Member name | Description
TwelveSEERSPointNineAFUESplitPackagedGasFiveToElevenTon
ElevenPointThreeEERPackagedVAVEightyFourPointFourPercentBoilerHeating
CentralVAVHWHeatChillerFivePointNinetySixCOPBoilersEightyFourPoint5Eff
FourPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightFourPointFiveEff
CentralVAVElectricResistanceHeatChillerFivePointNinetySixCOP
TwelveSEERSevenPointSevenHSPFSplitPackagedHeatPump
TwoPipeFanCoilSystemChillerFivePointNinetySixCOPBoilersEightyFourPointFiveEff
TwelveSEEREightPointThreeHSPFPackagedTerminalHeatPumpPTAC
ResidentialSeventeenSEERNinePointSixHSPFSplitHPLessThanFivePointFiveTon
UnderfloorAirDistribution
ResidentialFourteenSEERPointNineAFUESplitPackagedGasLessThanFivePointFiveTon
ResidentialFourteenSEEREightPointThreeHSPFSplitPackagedHeatPump
NoOfHVACSystemEnums
Remarks
 This enumeration corresponds to the HVAC System attribute in gbXML and is used to specify the Building HVAC System.
See Also
Autodesk.Revit.DB.Analysis Namespace